{"pageProps":{"categoryPostsData":[{"frontmatter":{"layout":"post","published":true,"title":"Solidity Developer Survey 2022 Results","date":"2023-03-10","author":"Franziska Heintel","category":"Announcements"},"content":"\nThe 2022 Solidity Developer Survey results are in! In this post, we will be summarizing and analyzing them.\n\nFirst of all, a big thank you to everybody who took the time and participated and to everybody who helped us spread the word about it!\nThis year, we received a smashing 1401 responses. That is more than a 3x in responses compared to the previous survey and we couldn't be happier with the turnout.\nYour input is invaluable to us and plays a crucial...","url":"/blog/2023/03/10/solidity-developer-survey-2022-results"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity Developer Survey 2022 is Live!","date":"2022-12-07","author":"Franziska Heintel","category":"Announcements"},"content":"\nIt’s that time of the year. Drumroll, please! 🥁🥁🥁\nWe are launching the Solidity Developer Survey 2022!\n\nBefore we wrap up 2022 for good, we want to reach out to collect your feedback and insights so we can improve on it!\n\n📝 TAKE THE SURVEY! 📝\n\nYou can find the previous results of the Solidity Developer Survey 2021 here. In 2021, 435 developers from 73 different countries participated with 80% of respondents using Solidity daily or weekly.\n\nAbout the Survey 🪄\n\nLike in previous years, this...","url":"/blog/2022/12/07/solidity-developer-survey-2022-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity Core Team Updates","date":"2022-12-05","author":"Solidity Team","category":"Announcements"},"content":"\nMore than two years have passed since we introduced Solidity core team members on the blog and we realized it is high time for some updates: Meet new team members, find out who moved on to other adventures and learn about recent changes in the team structure!\n\nBefore we dive in, a reminder that the Solidity programming language and compiler are open-source community projects. This post dives into the core team that leads the development. Nevertheless, we cannot stress enough how...","url":"/blog/2022/12/05/solidity-core-team-updates"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity Summit 2022 Recap","date":"2022-05-03","author":"Franziska Heintel","category":"Announcements"},"content":"\nWe can't believe it's already been two weeks since we met in Amsterdam for the second Solidity Summit!\n\nSolidity Summit 2022 was part of Devconnect and took place on Wednesday, April 20, 2022.\n\nWith roughly 250 participants, the event was well attended. In addition, approximately 400 people joined remotely by watching the Livepeer livestream.\n\nThe day was packed with 20+ talks on\n\nSolidity internals & deep dives\nSolidity language design\nSolidity tooling\nSecurity\nProgramming patterns\n\n... and more.\n\nThe full agenda of the day can be found here. You can...","url":"/blog/2022/05/03/solidity-summit-2022-recap"},{"frontmatter":{"layout":"post","published":true,"title":"Announcing the Winners of the Underhanded Solidity Contest 2022","date":"2022-04-09","author":"Franziska Heintel & USC Judges","category":"Announcements"},"content":"\nThe time has come to share this year's winners of the Underhanded Solidity Contest!\n\nBefore we dive into the winning submissions, let's revisit the most important features of the USC:\n\nIn a nutshell, the USC is about finding loopholes or “hiding spots” in the Solidity language and using those to write seemingly innocent and straightforward-looking Solidity code which contains malicious behavior or backdoors.\n\nThe Underhanded Solidity Contest aims to...\n\nRaise awareness about smart contract security.\nUncover language design faults.\nBattle-test recently introduced language features and restrictions.\nHighlight...","url":"/blog/2022/04/08/announcing-the-underhanded-contest-winners-2022"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity Summit 2022 Goes Amsterdam","date":"2022-02-22","author":"Franziska Heintel","category":"Announcements"},"content":"\nThe Solidity Summit is finally back! After a first virtual Solidity Summit in 2020, we are excited to announce an in-person event for 2022!\n\nSolidity Summit 2022 is part of Devconnect and will happen on Wednesday, April 20 2022, in Amsterdam.\n\nWhat is the Solidity Summit?\n\nThe Solidity Summit is a collaborative event focusing on the future of Solidity. It's a get together for advanced Solidity users and other Solidity ecosystem stakeholders such as developers interested in language design, tooling builders, auditors and...","url":"/blog/2022/02/22/solidity-summit-2022-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Underhanded Solidity Contest 2022","date":"2022-02-09","author":"Franziska Heintel","category":"Announcements"},"content":"\nThe long wait is over: The Underhanded Solidity Contest is back with a 2022 edition!\n\nAfter a successful revival in 2020, we believe it's time for the great Solidity minds to get together again and compete over the next big underhanded hack!\n\nIn case you're new to this, let's get you up to speed with a quick recap on what the Underhanded Solidity Contest (USC) is all about:\n\nIn a nutshell, the USC is about finding loopholes or \"hiding spots\" in the Solidity...","url":"/blog/2022/02/09/underhanded-solidity-contest-2022-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity Developer Survey 2021 Results","date":"2022-02-07","author":"Franziska Heintel","category":"Announcements"},"content":"\nIn this post, we will be summarizing and analyzing the results of the 2021 Solidity Developer Survey.\n\nA big thank you goes out to everybody who took the time and participated!\n\nYour input is invaluable to us and plays a crucial role in helping to continuously improve the Solidity developer experience as a whole.\n\nSummary & Notable Insights\n\nSurvey Audience**: In total, 435 developers from 73 different countries participated in the 2021 survey. Compared to 2020, that is more than a 100% increase in...","url":"/blog/2022/02/07/solidity-developer-survey-2021-results"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity Developer Survey 2021 is Live!","date":"2021-11-18","author":"Franziska Heintel","category":"Announcements"},"content":"\nToday, we launched the Solidity Developer Survey 2021. Please all take 10 minutes to participate and let us know your feedback!\n\nThis marks the second time we are conducting a structured big developer survey. You can find the results of last year's Solidity developer survey here.\n\nShape the Future of Solidity 🔮\n\nThe survey helps us to further improve the Solidity language and compiler and shape the future roadmap of Solidity. We can't wait to hear your thoughts on the prioritization of new...","url":"/blog/2021/11/18/solidity-developer-survey-2021"},{"frontmatter":{"layout":"post","published":true,"title":"Announcing Solidity Version Collectibles & Community Governance 💎","date":"2021-04-01","author":"Franziska Heintel","category":"Announcements"},"content":"⚠️ Attention: This post is an April Fools' Day joke. Please consume it at your own risk. We will not distribute any Solidity NFTs in the foreseeable future. Stay safe.\n\nToday, we are excited to announce a little surprise we’ve been working on silently for the last couple of weeks. We heard that you really like crypto-related collectibles and we listened.\n\nYou will soon be able to own a digital piece of Solidity’s history: We’re tokenizing each Solidity version as an NFT!...","url":"/blog/2021/04/01/announcing-solidity-collectibles"},{"frontmatter":{"layout":"post","published":true,"title":"Launching the Solidity Forum 🗃️","date":"2021-02-01","author":"Franziska Heintel","category":"Announcements"},"content":"\nIn our effort to foster exchange of information, encourage more developers to give feedback about Solidity and join the discussions on language design and future direction of the compiler, we are happy to launch the Solidity forum today!\n\nMoving forward the Solidity forum will be the dedicated place to discuss topics and questions related to…\n\nThe design of the Solidity programming language.\nThe Solidity compiler.\nUseful Solidity tips and code snippets.\nSolidity documentation and its translation.\nDiscussions and announcements about Solidity releases.\n\nIt will not be the...","url":"/blog/2021/02/01/launching-the-solidity-forum"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity Developer Survey 2020 Results","date":"2021-01-26","author":"Franziska Heintel","category":"Announcements"},"content":"\nBefore we dive into the results we want to extend a big thank you to all of the Solidity developers that participated in the very first Solidity Developer Survey, which we conducted at the end of last year!\n\nWe were overwhelmed by the high quality of the submissions and are happy to extract important insights from your input.\n\nIn this post, we'll be summarizing and commenting on the results of the survey.\n\nPlease note that none of the questions in the survey were...","url":"/blog/2021/01/26/solidity-developer-survey-2020-results"},{"frontmatter":{"layout":"post","published":true,"title":"Launching the Solidity Developer Survey 2020","date":"2020-12-09","author":"Franziska Heintel","category":"Announcements"},"content":"\nToday we are launching the Solidity Developer Survey 2020. It is the first time we share a proper language survey and we hope to turn this into an annual tradition moving forward.\n\nYou might remember the small feedback survey we did this year as part of the Solidity Summit registration in which we asked you for the most liked and dreaded Solidity features. If you're curious to revisit the results of that click here.\n\nHelp shape the future of Solidity 🔮\n\nSo why...","url":"/blog/2020/12/09/solidity-developer-survey-2020"},{"frontmatter":{"layout":"post","published":true,"title":"Announcing the Winners of the Underhanded Solidity Contest 👨‍💻🏅","date":"2020-12-03","author":"Franziska Heintel","category":"Announcements"},"content":"\nAfter thorough assessment of all submissions, we are happy to share the winners of this year's Underhanded Solidity Contest!\n\nIf you are not familiar with it, please read the announcement from September.\n\nBefore we dive into the winning submissions, we'd like to thank all participants for taking part. In total, we received 16 qualifying submissions which you can find in this repo. All 16 submissions are eligible for a \"qualified submission\" Underhanded Solidity POAP NFT - winners will receive an additional \"Winners\"...","url":"/blog/2020/12/03/solidity-underhanded-contest-winners"},{"frontmatter":{"layout":"post","published":true,"title":"Ask the Solidity Team Anything #1 Recap","date":"2020-11-04","author":"Solidity Team","category":"Announcements"},"content":"\nWe hosted our very first Solidity team AMA on Reddit last week! We would like to take the opportunity to summarize the most interesting and most upvoted questions & answers in this post.\n\nIf you are interested in going through the full AMA thread you can do so here.\n\nGeneral Questions\n\nRoadmap Outlook: What does the Solidity team see as its most important feature goals in the medium-long term and what are the biggest blockers to achieving those goals?\n\nAs far as the compiler...","url":"/blog/2020/11/04/solidity-ama-1-recap"},{"frontmatter":{"layout":"post","published":true,"title":"The Underhanded Solidity Contest is back!","date":"2020-09-21","author":"Franziska Heintel","category":"Announcements"},"content":"\nWe're excited to share that the Underhanded Solidity Contest is finally back!\n\nInspired by the Underhanded C Contest and the first Underhanded Solidity Contest, organized in 2017 by Nick Johnson, we decided it is time for a much needed revival.\n\nUnderhanded Solidity Contest\n\nThe goal of this contest is to write innocent-looking Solidity code, which pretends to be clear and straightforward, but actually contains malicious behavior or backdoors.\n\nBy hosting such a contest we aim to:\n\nRaise awareness about smart contract security.\nUncover language design flaws.\nBattle-test...","url":"/blog/2020/09/21/solidity-underhanded-contest"},{"frontmatter":{"layout":"post","published":true,"title":"Meet the Solidity team! 🧑‍💻👩‍💻","date":"2020-09-18","author":"Solidity Team","category":"Announcements"},"content":"\nAs you might know, Solidity is an open-source community project mainly developed and maintained by a core team.\n\nToday, we would like to introduce some of our team members and share insights into their professional background, which components of Solidity they mostly work on, what they would like to see in Solidity and in the ecosystem in future and more! Since almost all of our work happens on Github you can find each team member's Github handle next to their name.\n\nBefore...","url":"/blog/2020/09/18/meet-the-team"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity v0.1.0 turns 5! A walk down memory lane...","date":"2020-07-08","author":"Franziska Heintel","category":"Announcements"},"content":"\nSolidity v0.1.0 turns 5\n\nWith happiness and a tad of nostalgia, we'd like to share that Solidity v0.1.0 turns 5 years old today! (To be fair, v0.1.0 wasn't an actual release, but it marks the time where the Solidity team started appointing version numbers.) We are puzzled over how fast time flew by. We'd like to use this opportunity to take a look back and walk down the Solidity memory lane together with you.\n\nIn short: The Solidity language evolved rapidly, the...","url":"/blog/2020/07/08/solidity-turns-5"},{"frontmatter":{"layout":"post","published":true,"title":"Wrapping up the Virtual Solidity Summit 2020","date":"2020-06-09","author":"Franziska Heintel","category":"Announcements"},"content":"\nRoughly one month ago, we held the first Solidity Summit - a free interactive forum with discussions and talks on Solidity, Yul, language design and tooling. It took place on April 29-30 and was powered by a virtual meeting infrastructure based on open-source, self-hosted Jitsi video chat rooms. The platform was supplied by Interspace.Chat.\n\nBefore we dive into the recap: Your input and active participation was much appreciated and we want to take this opportunity to say thank you! We hope...","url":"/blog/2020/06/09/solidity-summit-recap"},{"frontmatter":{"layout":"post","published":true,"title":"Sourcify: Towards Safer Contract Interaction for Humans","date":"2020-06-02","author":"Edi Sinovčić, Franziska Heintel","category":"Announcements"},"content":"\ntl;dr: Building sensible blockchain applications for humans is hard. You can enhance the user experience of\nyour dapp today by leveraging the power of open source. Increase awareness and give more transparency on what users\nare actually doing when interacting with your code on the blockchain, i.e. when signing a transaction, by publishing\nthe source code to this decentralized repository and using metadata files, which translate “random” hex strings into\nhuman-readable language. Sourcify is a tool to help you do exactly that. If you...","url":"/blog/2020/06/02/Sourcify-Towards-Safer-Contract-Interaction-for-Humans"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity Summit 2020 Goes Interspace","date":"2020-04-17","author":"Franziska Heintel","category":"Announcements"},"content":"\nTl;dr: As already announced on Twitter, we transformed the Solidity Summit, which was initially planned to be an in-person meeting in Berlin, into an online event. Today, we are excited to share that the summit will be powered by Interspace.Chat. Interspace is a virtual meeting infrastructure based on self-hosted Jitsi video chat rooms. Check out the Solidity Summit's preliminary event agenda here and make sure to register if you want to partipate!\n\nWhat is the Solidity Summit?\n\nThe Solidity Summit is a...","url":"/blog/2020/04/17/Solidity-Summit-2020-Goes-Interspace"},{"frontmatter":{"layout":"post","published":true,"title":"Dev Update: Formal Methods","date":"2016-09-01","author":"Christian Reitwiessner","category":"Announcements"},"content":"\nThis post was originally published on the Ethereum blog.\n\nToday, I am delighted to announce that Yoichi Hirai (@pirapira on github) is joining the Ethereum project as a formal verification engineer. He holds a PhD from the University of Tokyo on the topic of formalizing communicating parallel processes and created formal verification tools for Ethereum in his spare time.\n\nIn his own words:\nI’m joining Ethereum as a formal verification engineer. My reasoning: formal verification makes sense as a profession only in a...","url":"/blog/2016/09/01/formal-methods-roadmap"}],"category":"Announcements"},"__N_SSG":true}