{"pageProps":{"categoryPostsData":[{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.20 Release Announcement","date":"2023-05-10","author":"Solidity Team","category":"Releases"},"content":"\nWe are excited to announce the latest release of the Solidity Compiler, Solidity v0.8.20.\nThis latest version includes a range of improvements in the via-IR pipeline and improves the list of events exposed in the contract ABI, and, most importantly, support for the Shanghai hard fork!\n\nImportant Note\n\nThis compiler switches the default target EVM version to Shanghai, which means that the generated bytecode will include PUSH0 opcodes.\nBe sure to select the appropriate EVM version in case you intend to deploy on a...","url":"/blog/2023/05/10/solidity-0.8.20-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.19 Release Announcement","date":"2023-02-22","author":"Solidity Team","category":"Releases"},"content":"\nWe are excited to announce the latest release of the Solidity Compiler, Solidity v0.8.19.\nThis latest version includes a range of improvements and it also introduces the support for defining operators on user-defined value types (UDVTs)!\nYou can learn about it at length in our feature deep-dive blogpost.\n\nNotable New Features\n\nThese are the features we want to highlight in this release.\n\nOperators for User-Defined Value Types\n\nThe ability to use operators is meant to bring the UDVTs closer to being as natural to use\nas the...","url":"/blog/2023/02/22/solidity-0.8.19-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.18 Release Announcement","date":"2023-02-01","author":"Solidity Team","category":"Releases"},"content":"\nIntroducing the newest version of the Solidity Compiler!\n\nWe are excited to announce the latest release of the Solidity Compiler, Solidity v0.8.18.\nThis latest version includes a range of improvements and it also introduces support for the Paris upgrade!\n\nNotable New Features\n\nThese are the features we want to highlight in this release.\n\nDisabling CBOR metadata\n\nA new command-line flag (--no-cbor-metadata) and Standard JSON option (settings.metadata.appendCBOR: false) to prevent compiler from appending the CBOR metadata section at the end of the bytecode.\nUntil now, it was only...","url":"/blog/2023/02/01/solidity-0.8.18-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.17 Release Announcement","date":"2022-09-08","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.17\nfixes an important bug, makes overflow checks on multiplication more efficient and adds an LSP feature to\nalways analyze all files in a project.\n\nImportant Bugs\n\nStorage Write Removal Bug On Conditional Early Termination\n\nThe bug may result in storage writes being incorrectly considered redundant and removed by the optimizer.\nThe problem manifests in presence of assembly functions that may conditionally terminate the external\nEVM call using the return() or stop() opcode.\n\nSee the security alert post on Storage Write Removal Bug On Conditional Early Termination\nfor...","url":"/blog/2022/09/08/solidity-0.8.17-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.16 Release Announcement","date":"2022-08-08","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.16\nfixes an important bug.\n\nThe bug may result in small parts of dynamic tuple components being inadvertently zeroed during\nABI re-encoding when the last component is a statically-sized uint or bytes32 calldata array.\nSee Head Overflow Bug in Calldata Tuple ABI-Reencoding\nfor more information.\n\nApart from that, there are several minor bug fixes and improvements like more gas-efficient overflow checks\nfor addition and subtraction.\n\nFull Changelog\n\nImportant Bugfixes:\n\nCode Generation: Fix data corruption that affected ABI-encoding of calldata values represented by tuples: structs at any nesting level; argument...","url":"/blog/2022/08/08/solidity-0.8.16-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.15 Release Announcement","date":"2022-06-15","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.15\nfixes two important bugs, improves inlining heuristics and adds a .selector member for errors and events.\n\nImportant Bugs\n\nThe first one is an optimizer bug that can lead to memory write operations in inline assembly being removed if\nthe result of such an operation is not read back from within the same assembly block.\nThe bug can be triggered only when using the default legacy compiler pipeline (the new compilation pipeline via\nIR is not affected) and happens only in assembly blocks that never...","url":"/blog/2022/06/15/solidity-0.8.15-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.14 Release Announcement","date":"2022-05-18","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.14\nfixes two important bugs.\n\nThe first one is related to ABI-encoding nested arrays directly from calldata.\nYou can find more information in the blog post.\n\nThe second bug is triggered in certain inheritance structures and can\ncause a memory pointer to be interpreted as a calldata pointer or\nvice-versa. We also have a dedicated blog post about this bug.\n\nApart from these, there are several minor bug fixes and improvements.\n\nPlease note: Unfortunately, the npm wrapper package of this version is corrupted. Using the new soljson.js...","url":"/blog/2022/05/17/solidity-0.8.14-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.13 Release Announcement","date":"2022-03-16","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.13\nfixes an important bug related to abi.encodeCall, extends the using for\ndirective and implements \"go to definition\" for the language server.\n\nFurthermore, compiling via the new Yul IR pipeline is now considered production ready.\n\nImportant Bugs\n\nWhen abi.encodeCall was introduced in Solidity 0.8.11,\nhex literals (0x1234) and string literals (\"abcd\") were not handled properly.\nPlease read more about it in the security alert.\n\nNotable New Features\n\nYul IR Pipeline Production Ready\n\nWe have been working on Yul as an intermediate language for Solidity for several years now.\nYul in...","url":"/blog/2022/03/16/solidity-0.8.13-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.12 Release Announcement","date":"2022-02-16","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.12\nimproves the JavaScript / Wasm binary and fixes several bugs.\n\nNotable New Features\n\nEmscripten Build / solc-js\n\nWe were able to reduce the size of the JavaScript / WebAssembly\nbinaries from 27 MB to just over 8 MB. The reason for the large binary\nin the first place is that we include the SMT solver Z3.\n\nThe size reduction is achieved by compressing the binary using LZ4 and\ndecompressing it when it is loaded, which should be completely transparent to the user.\nWe were initially worried that...","url":"/blog/2022/02/16/solidity-0.8.12-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.11 Release Announcement","date":"2021-12-20","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.11\nadds a first implementation of a Language Server, allows a safer way to\nperform ABI-encoding and fixes several bugs.\n\nNotable New Features\n\nLanguage Server Preview\n\nLanguage Server Protocol\nis an initiative that allows better interoperability between IDEs and\ncompilers, or more generally, language diagnostics tools. The idea is that\ninstead of writing a different plugin for each combination of IDEs and\nlanguages, every IDE implements a single client and every compiler implements\na single server and since both of them use the same protocol, you can combine\nall of...","url":"/blog/2021/12/20/solidity-0.8.11-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.10 Release Announcement","date":"2021-11-09","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.10 can now report contract invariants and reentrancy properties through the SMTChecker. It also contains some new optimizations with regards to external function calls and enables the new EVM code generator for pure Yul mode.\n\nNotable New Features\n\nNew EVM Code Transform for Compilation via Yul IR\n\nWith this release, we introduce a new EVM code generation backend that is used for the experimental compilation pipeline of Solidity via Yul (with enabled optimizer), as well as for optimized compilation of Yul input.\n\nWhile...","url":"/blog/2021/11/09/solidity-0.8.10-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.9 Release Announcement","date":"2021-09-29","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.9 is a pure bugfix release and fixes two important, but low severity, bugs.\n\nThe first bug is related to immutables of signed integer types shorter than 256 bits. The bug causes sign extension (cleanup) of those values to not always being properly performed. It was introduced in Solidity 0.6.5. Read more in the respective security alert.\nThe second bug was introduced with user defined value types in Solidity v0.8.8 (released two days ago). User defined types with underlying type shorter...","url":"/blog/2021/09/29/solidity-0.8.9-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.8 Release Announcement","date":"2021-09-27","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.8 introduces user defined\nvalue types as a major feature. The override keyword is now optional for interface functions,\nimmutable variables can be read in the constructor, there is support for retrieving the smallest\nand largest value of an enum, you can specify include directories and the commandline interface was cleaned up.\nFurthermore, we fixed several bugs and the SMTChecker has improved language coverage.\n\nNotable New Features\n\nUser Defined Value Types\n\nA user defined value type allows creating a zero-cost-abstraction over an elementary value type that\nalso...","url":"/blog/2021/09/27/solidity-0.8.8-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.7 Release Announcement","date":"2021-08-11","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.7 introduces support for\nthe London upgrade, includes\nvarious improvements to Yul to EVM code transformation, the SMTChecker and some bugfixes.\n\nPlease note: Unfortunately, the npm package of this version is corrupted. Pulling the solc-js repository directly will work.\n\nSupport for London Upgrade\n\nSolidity adds support for the BASEFEE opcode (EIP-3198\nand EIP-1559) which exposes the block's base fee. This\ncan be accessed via the global block.basefee or using basefee() in inline assembly or Yul.\n\nThe following contract illustrates an example:\n\ncontract Basefee {\n    function...","url":"/blog/2021/08/11/solidity-0.8.7-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.6 Release Announcement","date":"2021-06-22","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.6 fixes some\nnon-critical but annoying bugs, especially a warning about unreachable code that\nis in fact reachable.\n\nBugfixes\n\nUnreachable Warning\n\nWith Solidity 0.8.5, we released a new feature that detects if code is unreachable\nbecause a called function always reverts before the code is executed. This detection contained a bug\nin connection with nested calls to internal library functions where the \"reverting behaviour\"\nof a function was not properly updated after a\nfunction called by it was determined to be not always reverting.\n\nBecause the bug was rather...","url":"/blog/2021/06/22/solidity-0.8.6-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.5 Release Announcement","date":"2021-06-10","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.5 allows conversions\nfrom bytes to bytesNN values, adds the verbatim builtin function to inject\narbitrary bytecode in Yul and fixes several smaller bugs.\n\nNotable New Features\n\nBytes Conversion\n\nFind the complete feature documentation here.\n\nThis release introduces the ability to convert bytes and bytes slices to fixed bytes types bytes1 / ... / bytes32. While conversion between fixed-length bytes types has always been possible, it is now also possible to convert dynamically-sized bytes types to fixed-length bytes types.\n\nIn case a byte array is longer...","url":"/blog/2021/06/10/solidity-0.8.5-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.4 Release Announcement","date":"2021-04-21","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.4 adds custom structured errors, bytes.concat(...), allows more flexible\nconfiguration of the SMT checker and fixes a bug in the Solidity ABI decoder v2.\n\nImportant Bugfixes:\n\nOn April 5th, 2021, a bug in the Solidity ABI decoder v2 was reported by John Toman of the Certora development team. For two-dimensional arrays and specially crafted data in memory, the result of abi.decode can depend on data elsewhere in memory. Calldata decoding is not affected. The bug is present in all prior versions of...","url":"/blog/2021/04/21/solidity-0.8.4-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.3 Release Announcement","date":"2021-03-23","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.3 fixes the Solidity Optimizer Keccak Caching Bug, which is present in all prior versions of Solidity, and, in addition, includes two improvements to the optimizer which can provide a big gas benefit when writing structs that cover a full storage slot to storage.\n\nImportant Bugfixes\n\nSolidity Optimizer Keccak Caching Bug\n\nOn March 20, 2021, a bug in Solidity’s bytecode optimizer was found by differential fuzzing. The bug is fixed with this version. The bug is present in all prior versions of...","url":"/blog/2021/03/23/solidity-0.8.3-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.2 Release Announcement","date":"2021-03-02","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.2 adds an optimizer stage that can inline small amounts of code to save gas and\nprovides more means to work with code documentation by exporting inline comments\nand allowing custom natspec tags.\n\nNotable New Features\n\nInliner\n\nThis release adds a simple inliner to the low-level optimizer of Solidity.\nIt can inline short functions that do not contain control-flow branches or\nopcodes with side-effects. If you want to learn more about the inliner, read this post.\n\nCustom Natspec and Exported Documentation\n\nIt is now possible to use documentation...","url":"/blog/2021/03/02/solidity-0.8.2-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.1 Release Announcement","date":"2021-01-27","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.8.1 introduces\nmany new features for the SMTChecker (see below), updates the\nemscripten version for building soljson.js to 2.0.12,\nallows to catch panic errors and adds other small improvements.\n\nNotable New Features\n\nSMTChecker Counterexamples and Synthesis of External Functions\n\nThe SMTChecker already reports transaction traces as counterexamples to failing verification\ntargets, but 0.8.1 adds internal calls, msg.value and synthesized unknown code called\nexternally in the form of reentrant calls to counterexamples.\nA recent blog post\npresents that topic in more detail.\n\nHow to select SMTChecker targets\n\nPrior to 0.8.1, the SMTChecker...","url":"/blog/2021/01/27/solidity-0.8.1-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.0 Release Announcement","date":"2020-12-16","author":"Solidity Team","category":"Releases"},"content":"\nSolidity 0.8.0 is a breaking release of the Solidity compiler and language.\n\nSome of the new features of this release have been elaborated in the 0.8.x preview release post. Please consider the preview release binary superseded and do not use it anymore.\n\nNotable New Features and Changes\n\nAs per ususal, this breaking release does not include many features but rather changes that require a\nbackwards-incompatible adjustment in syntax or semantics. For a detailed explanation,\nplease see the documentation.\n\nThe change that will affect most users is...","url":"/blog/2020/12/16/solidity-v0.8.0-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.7.6 Release Announcement","date":"2020-12-16","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.7.6 adds better support for calldata types. Furthermore, the fallback function can now have a parameter and explicitly return data.\n\nNotable New Features\n\nDetection of Overflowing Unicode Direction Markers\n\nThe winning entry in the\nSolidity Underhanded Contest\nused a clever combination of Unicode direction markers to deceive the reader about\nthe semantics of a time-locked upgrade mechanism. Starting from Solidity 0.7.6, the parser will reject\ncomments and Unicode strings where the text direction is not properly reset before the end of the\ncomment or string.\n\nBetter Support for...","url":"/blog/2020/12/16/solidity-0.7.6-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.7.5 Release Announcement","date":"2020-11-18","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.7.5 adds the ability so select the ABI coder via pragma abicoder v1 and pragma abicoder v2 in preparation for making ABI coder v2 the default for 0.8.0 and introduces --experimental-via-ir which compiles via the new experimental Yul-based compiler pipeline.\n\nFull Changelog\n\nLanguage Features:\n\nAbility to select the abi coder using pragma abicoder v1 and pragma abicoder v2.\nInline Assembly: Use .offset and .length for calldata variables of dynamic array type to access their calldata offset and length (number of elements). Both of...","url":"/blog/2020/11/18/solidity-0.7.5-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.8.x Preview Release","date":"2020-10-28","author":"Solidity Team","category":"Releases"},"content":"\nWith the Solidity 0.8.x series being just around the corner, we would like to provide insights into the upcoming breaking changes that will come with it.\n\nWe want to provide a preview release binary for everyone to try out so that you can give your feedback.\n\nThe main change for 0.8.x is the switch to checked arithmetic operations by default.\nThis means that x + y will throw an exception on overflow. In other words: You will not need SafeMath anymore!\n\nSince the scope...","url":"/blog/2020/10/28/solidity-0.8.x-preview"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.7.4 Release Announcement","date":"2020-10-19","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.7.4 fixes a storage corruption bug of medium severity.\nTo learn more about the bug and to check if your contract is vulnerable please read this post with further details about the bug. The bug has been reported by John Toman of the Certora development team.\n\nAdditionally, v0.7.4 adds constants at file-level.\n\nImportant Bugfixes\n\nCode Generator: Fix data corruption bug when copying empty byte arrays from memory or calldata to storage. Read more here.\n\nNotable New Features\n\nConstants at File-Level\n\nIn order to make functions at...","url":"/blog/2020/10/19/solidity-0.7.4-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.7.3 Release Announcement","date":"2020-10-07","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.7.3 fixes a bug in the dynamic-array cleanup.\nTo learn more about the bug and check if your contract is vulnerable please read this post with further details about the bug.\nAdditionally, v0.7.3 adds the option to stop compilation after the parsing stage using solc --stop-after parsing.\n\nImportant Bugfixes\n\nCode Generator: Properly cleanup after copying dynamic-array to storage for packed types. Read more here.\n\nNotable New Features\n\nStop Compilation after Parsing\n\nsolc --stop-after parsing (or settings.stopAfter = 'parsing' in standard-json) can now be used to instruct...","url":"/blog/2020/10/07/solidity-0.7.3-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.7.2 Release Announcement","date":"2020-09-28","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.7.2 fixes a bug in free functions, which had been introduced with v0.7.1, and adds compiler-generated utility file export. Furthermore, it comes with a considerably broadened language support of the SMTChecker.\n\nImportant Bugfixes\n\nFree Function Overloading Checks\n\nFree functions were introduced in the previous release (Solidity v0.7.1). It turned out that it was possible\nto define a function with the same name multiple times, even containing the same parameter types.\nAllowing two functions with the same name, but different parameter types is called \"overloading\"\nand...","url":"/blog/2020/09/28/solidity-0.7.2-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.7.1 Release Announcement","date":"2020-09-02","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.7.1 adds functions at file-level and fixes several small bugs.\n\nNotable New Features\n\nFunctions At File-Level\n\nFunctions can now be defined at file-level. Such functions are called \"free functions\"\n(as opposed to functions bound to a specific contract).\n\nFree functions are always internal functions\nand are meant to replace internal library functions and their very special behaviour.\n\nA free function behaves like an internal function of the contract that called it.\nThe main difference is that a free function cannot directly access state variables and internal\nfunctions of...","url":"/blog/2020/09/02/solidity-0.7.1-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.7.0 Release Announcement","date":"2020-07-28","author":"Solidity Team","category":"Releases"},"content":"\nSolidity 0.7.0 is a breaking release of the Solidity compiler and language.\n\nThis release does not include many features but rather changes that require a\nbackwards-incompatible adjustment in syntax or semantics. For a detailed explanation,\nplease see the documentation.\n\nMost notably, further cleanup of visibility and state mutability has been performed\nand several unpopular keywords have been removed. Types with mappings\nin memory are disallowed and shift and exponentiation operations use more reasonable types.\n\nSince we usually do not backport bugfixes, it is recommended to upgrade all...","url":"/blog/2020/07/28/solidity-v0.7.0-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.6.12 Release Announcement","date":"2020-07-22","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.6.12 adds more flexibility\nwhen using inheritance with NatSpec comments and introduces many small improvements to the optimizer.\n\nNotable New Features\n\nNatSpec Inheritance\n\nAs explained in the Solidity 0.6.11 release announcement,\nNatSpec comments are now inherited automatically if you do not provide any\nNatSpec in the derived function. Starting from Solidity 0.6.12, you can\nexplicitly inherit comments from a base contract using the tag @inheritdoc\neven if you specify some of the tags.\nThe tags that are not given will then be taken from the specified base class'\nfunction.\n\n//...","url":"/blog/2020/07/22/Solidity-0612-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.6.11 Release Announcement","date":"2020-07-07","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.6.11 adds inheritance to NatSpec comments,\nimproves debugging data output and fixes some minor issues with opening up calldata for non-external functions.\n\nNotable New Features\n\nNatSpec Inheritance and on Events\n\nNatSpec comments are a way to describe the behaviour of a function to end-users. It also allows\nto provide more detailed information to developers.\n\nOne regular use-case is that you document the behaviour of an interface and then implement\nthe interface in a derived contract. Previously, you had to repeat the documentation in the derived\ncontract. This...","url":"/blog/2020/07/07/Solidity-0611-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.6.10 Release Announcement","date":"2020-06-11","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.6.10 fixes an important bug that was introduced in the previous release and adds error codes.\n\nPlease upgrade if you are using internal library functions with calldata parameters in connection with using for.\n\nImportant Bugfixes\n\nInvalid Access for Calldata Parameters in Internal Library Functions\n\nProblem: The previous release, Solidity 0.6.9, introduced the possibility to use calldata types in internal and not, as previously, only in external functions.\nThis resulted in a bug related to calling library functions with calldata parameters via using for.\nMore specifically,...","url":"/blog/2020/06/11/Solidity-0610-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.6.9 Release Announcement","date":"2020-06-05","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.6.9 adds SMT-checking to solc-js,\nallows calldata for all variables and provides a mechanism to specify an import directory.\n\nPlease note that the solc-js / soljson binary includes the Z3 SMT solver built-in, which causes an increase in the binary size.\n\nNotable New Features\n\nSMTChecker\n\nThe SMTChecker is a component of the Solidity compiler which has been in development for quite some time now.\n\nIts aim is to bring formal verification methods to the Solidity compiler. Solidity implements a formal verification approach based on SMT/Horn...","url":"/blog/2020/06/05/Solidity-069-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.6.8 Release Announcement","date":"2020-05-14","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.6.8 fixes three important bugs in the code generator and introduces a recommendation to use SPDX license identifiers. Furthermore, support for WebAssembly has been extended and it is now possible to access the min and max values of an integer type directly.\n\nPlease upgrade if you are using array slices, backslashes in string literals for ABIEncoderV2 or are concerned about non-payable constructors.\n\nImportant Bugfixes\n\nPlease note that the three bugs outlined below have all been rated with a severity level of \"very...","url":"/blog/2020/05/14/Solidity-068-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.6.7 Release Announcement","date":"2020-05-04","author":"Solidity Team","category":"Releases"},"content":"\nSolidity v0.6.7 introduces support for EIP-165 via type(InterfaceName).interfaceId.\n\nLanguage Features:\n\nAdd support for EIP 165 interface identifiers with type(I).interfaceId.\nAllow virtual modifiers inside abstract contracts to have empty body.\n\nCompiler Features:\n\nOptimizer: Simplify repeated AND and OR operations.\nOption to specify optimization steps to be performed by Yul optimizer with yul-optimizations in the commandline interface or optimizer.details.yulDetails.optimizerSteps in standard-json.\nStandard Json Input: Support the prefix file:// in the field urls.\n\nBugfixes:\n\nSMTChecker: Fix internal error when fixed points are used.\nSMTChecker: Fix internal error when using array slices.\nType Checker: Disallow...","url":"/blog/2020/05/04/solidity-0.6.7-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.6.6 Release Announcement","date":"2020-04-09","author":"Solidity Team","category":"Releases"},"content":"\nThis is a small bugfix release that solves an issue with certain tuple assignments.\n\nImportant Bugfixes:\n\nFix tuple assignments with components occupying multiple stack slots and different stack size on left- and right-hand-side.\n\nBugfixes:\n\nAST export: Export immutable property in the field mutability.\nSMTChecker: Fix internal error in the CHC engine when calling inherited functions internally.\nType Checker: Error when trying to encode functions with call options gas and value set.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version...","url":"/blog/2020/04/09/solidity-0.6.6-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.6.5 Release Announcement","date":"2020-04-06","author":"Solidity Team","category":"Releases"},"content":"\nVersion 0.6.5 of Solidity fixes an important bug and introduces immutable as a major feature.\n\nThe bug concerns the allocation of dynamic memory arrays using e.g. new uint. The bug is considered to have a severity level of \"low\" but is present in all prior versions of Solidity. Therefore, please read more about how check if your contract is vulnerable in this blog post.\n\nThe immutable feature supports setting contract-level variables at construction time if they do not change later on. These...","url":"/blog/2020/04/06/solidity-0.6.5-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.17 Release Announcement","date":"2020-03-17","author":"Solidity Team","category":"Releases"},"content":"\nThis maintenance release of the 0.5.x series fixes a bug that was always present in the compiler. Some people do not even consider it a bug, though, which might explain why it was undiscovered for so long:\n\nA private function can be overridden in a derived contract by a private function of the same name and types. In other words, the virtual function calling mechanism does not respect visibility.\nThe same applies to two private functions of the same name and type...","url":"/blog/2020/03/17/solidity-0.5.17-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.6.4 Release Announcement","date":"2020-03-10","author":"Solidity Team","category":"Releases"},"content":"\nVersion 0.6.4 of Solidity fixes a bug that did not allow calling base contract functions directly, another bug that caused issues with variable scoping in try/catch and it allows for greater flexibility with regards to storage: It is now possible to set storage slots for storage reference variables from inline assembly. We expect this to allow new patterns in connection to delegatecall proxies and upgradable contracts. Please be careful when using this feature!\n\nLanguage Features:\n\nGeneral: Deprecated value(...) and gas(...) in favor...","url":"/blog/2020/03/10/solidity-0.6.4-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.6.3 Release Announcement","date":"2020-02-18","author":"Solidity Team","category":"Releases"},"content":"\nThis release adds reason strings for compiler-generated reverts if you specify revert-strings debug or use the setting settings.debug.revertStrings = \"debug\". Furthermore, contract types and enums are now allowed as keys for mappings and the doxygen-style comments are better supported by the AST.\n\nLanguage Features:\n\nAllow contract types and enums as keys for mappings.\nAllow function selectors to be used as compile-time constants.\n\nCompiler Features:\n\nAST: Add a new node for doxygen-style, structured documentation that can be received by contract, function, event and modifier definitions.\nCode Generator:...","url":"/blog/2020/02/18/solidity-0.6.3-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.6.2 Release Announcement","date":"2020-01-27","author":"Solidity Team","category":"Releases"},"content":"\nAfter long discussions, we finally enabled a high-level way to use the create2 opcode introduced in Constantinople: When creating a contract, you can specify the salt as a \"function call option\": new Contract{salt: 0x1234}(arg1, arg2). We took this opportunity and also extended the use of these function call options to specifying the gas and value options in external function calls: c.f{value: 10, gas: 20000}(arg1, arg2).\n\nFurthermore, interfaces can now inherit from interfaces, making them even more useful for specification purposes.\n\nTo allow...","url":"/blog/2020/01/27/solidity-0.6.2-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.6.1 Release Announcement","date":"2020-01-02","author":"Solidity Team","category":"Releases"},"content":"\nThis release fixes a bug in the Yul optimizer related to break and continue statements in loops. The Yul optimizer is part of the regular optimizer since version 0.6.0. In version 0.5.x, you had to explicitly activate the Yul optimizer in addition to the regular optimizer. The Yul optimizer only operates on the code generated by ABIEncoderV2 or if you use it in a stand-alone way. The code generated by ABIEncoderV2 does not make use of break and continue, but...","url":"/blog/2020/01/02/solidity-0.6.1-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.16 Release Announcement","date":"2020-01-02","author":"Solidity Team","category":"Releases"},"content":"\nThis release fixes a bug in the Yul optimizer. You are only affected if you manually enabled the Yul optimizer (not the regular optimizer) and either used Yul stand-alone or via ABIEncoderV2. For more details, please see buglist.json.\n\nBugfixes:\n\nYul Optimizer: Fix bug in redundant assignment remover in combination with break and continue statements.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2020/01/02/solidity-0.5.16-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.6.0 Release Announcement","date":"2019-12-17","author":"Solidity Team","category":"Releases"},"content":"\nThis is a major breaking release of the Solidity compiler and language. Changes include explicit virtual and override keywords in inheritance, support for try/catch, splitting the fallback function into a receive Ether function and an actual fallback function and limitations on how the length of an array can be changed, among others. For a detailed explanation, please see the documentation or refer to the list below that shows every single change.\n\nFrom this release on, ABIEncoderV2 is not considered experimental any...","url":"/blog/2019/12/17/solidity-0.6.0-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.15 Release Announcement","date":"2019-12-17","author":"Solidity Team","category":"Releases"},"content":"\nThis release fixes a bug that was introduced in 0.5.14 (the previous release). You are only affected if you manually enabled the Yul optimizer (not the regular optimizer) and either used Yul stand-alone or via ABIEncoderV2. For more details, please see buglist.json.\n\nBugfixes:\n\nYul Optimizer: Fix incorrect redundant load optimization crossing user-defined functions that contain for-loops with memory / storage writes.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2019/12/17/solidity-0.5.15-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.14 Release Announcement","date":"2019-12-09","author":"Solidity Team","category":"Releases"},"content":"\nSolidity 0.5.14 sets the default EVM version to \"Istanbul\" and is targeted as the last release in the 0.5.x series.\n\nThe SMT checker supports constructors now and it is possible to directly translate EVM-flavoured Yul to Ewasm from the commandline interface.\n\nLanguage Features:\n\nAllow to obtain the selector of public or external library functions via a member .selector.\nParser: Allow splitting string and hexadecimal string literals into multiple parts.\nInline Assembly: Support constants that reference other constants.\n\nCompiler Features:\n\nCommandline Interface: Allow translation from yul / strict...","url":"/blog/2019/12/09/solidity-0.5.14-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.13 Release Announcement","date":"2019-11-14","author":"Solidity Team","category":"Releases"},"content":"\nSolidity 0.5.13 provides Istanbul-EVM compatibility (default is still set to Petersburg), is the first version to generate Ethereum-Webassembly (EWasm) binary output (not fully working yet, though), improves the developer experience by listing potential overloads when resolution fails and can output the layout of the storage variables of a contract. As with all other releases, the coverage of the SMT checker is further improved.\n\nLanguage Features:\n\nAllow to obtain the address of a linked library with address(LibraryName).\n\nCompiler Features:\n\nCode Generator: Use SELFBALANCE opcode for...","url":"/blog/2019/11/14/solidity-0.5.13-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.12 Release Announcement","date":"2019-10-01","author":"Solidity Team","category":"Releases"},"content":"\nThis is a small bugfix release that also includes loop support for the SMT solver and some improvements to the Yul optimizer. The reason for the smaller feature set is that we are mainly working on the upcoming 0.6.0 release.\n\nLanguage Features:\n\nType Checker: Allow assignment to external function arguments except for reference types.\n\nCompiler Features:\n\nABI Output: Change sorting order of functions from selector to kind, name.\nOptimizer: Add rule that replaces the BYTE opcode by 0 if the first argument is larger than...","url":"/blog/2019/10/01/solidity-0.5.12-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.11 Release Announcement","date":"2019-08-12","author":"Solidity Team","category":"Releases"},"content":"\nThis release fixes a bug related to calldata structs in ABIEncoderV2 and calldata decoding in V1. Several internal bugs of the SMT checker are fixed.\nFurthermore, internal types are added to the ABI output which allows you to see which struct type is behind an ABI tuple. Finally, Yul and web assembly support are progressing.\n\nWe also improved our testing framework which now allows for semantics tests to run in 4 seconds instead of 1 minute.\n\nLanguage Features:\n\nInline Assembly: Support direct constants of...","url":"/blog/2019/08/12/solidity-0.5.11-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.10 Release Announcement","date":"2019-06-25","author":"Solidity Team","category":"Releases"},"content":"\nApart from further invisible work on the Yul optimizer, the Solidity to Yul code generation, the eWasm backend and the SMT checker, this release contains two important bug fixes related to storage arrays.\n\nFor details see our earlier blog post.\n\nIt also contains an experimental mode that allows recovery from parser error (implemented by @rocky, funded by ConsenSys) in the hope that this might be useful for IDE developers.\n\nImportant Bugfixes:\n\nABIEncoderV2: Fix incorrect abi encoding of storage array of data type that occupy...","url":"/blog/2019/06/25/solidity-0.5.10-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.9 Release Announcement","date":"2019-05-28","author":"Solidity Team","category":"Releases"},"content":"\nAs in previous releases, we spent most of the time making Solidity future-proof by further working on the Yul optimizer, the Solidity to Yul (and eWasm) translator and the SMT Checker.\n\nCode generated from Solidity now always includes the version number in the CBOR metadata so that it becomes possible to quickly assess whether a contract might be affected by a compiler bug or not.\n\nLanguage Features:\n\nInline Assembly: Revert change introduced in 0.5.7: The callvalue() instruction does not require payable anymore.\nStatic Analyzer:...","url":"/blog/2019/05/28/solidity-0.5.9-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.8 Release Announcement","date":"2019-04-30","author":"Solidity Team","category":"Releases"},"content":"\nThis release fixes important but very unlikely bugs and further completes ABIEncoderV2, SMTChecker and Yul and improves the optimizer.\n\nNotably, if ABIEncoderV2 is activated, the ABI decoder will now revert on input with dirty higher order bits instead of ignoring those bits.\n\nImportant Bugfixes:\n\nCode Generator: Fix initialization routine of uninitialized internal function pointers in constructor context.\nType System: Use correct type name for contracts in event parameters when used in libraries. This affected code generation.\nYul Optimizer: Fix SSA transform for multi-assignments.\n\nLanguage Features:\n\nABIEncoderV2: Implement...","url":"/blog/2019/04/30/solidity-0.5.8-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.26 Release Announcement","date":"2019-04-29","author":"Solidity Team","category":"Releases"},"content":"\nThis is a bugfix release for the 0.4.x series that contains backported fixes for important bugs that affected code generation. It also contains a fix that makes the emscripten target compatible with newer browser versions.\n\nImportant Bugfixes:\n\nCode Generator: Fix initialization routine of uninitialized internal function pointers in constructor context.\nType System: Use correct type name for contracts in event parameters when used in libraries. This affected code generation.\n\nBugfixes:\n\nABIEncoderV2: Refuse to generate code that is known to be potentially buggy.\nGeneral: Split rule list...","url":"/blog/2019/04/29/solidity-0.4.26-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.7 Release Announcement","date":"2019-03-26","author":"Solidity Team","category":"Releases"},"content":"\nThis release mainly fixes bugs in the optimizer and in the experimental ABI encoder. For details about the bug, please see the official announcement.\n\nFurthermore, this release also allows you to use Yul as a language option (instead of \"Solidity\") in the standard-json-interface.\n\nImportant Bugfixes:\n\nABIEncoderV2: Fix bugs related to loading short value types from storage when encoding an array or struct from storage.\nABIEncoderV2: Fix buffer overflow problem when encoding packed array from storage.\nOptimizer: Fix wrong ordering of arguments in byte optimization rule...","url":"/blog/2019/03/26/solidity-0.5.7-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.6 Release Announcement","date":"2019-03-13","author":"Solidity Team","category":"Releases"},"content":"\nThis release mainly fixes an optimizer bug related to multiple shift opcodes that was introduced in the previous release. It is unlikely that any existing contracts are affected, but you should still not use Solidity 0.5.5.\n\nApart from that, the support for calldata structs and arrays by ABIEncoderV2 is almost finished now, we added some more optimizer rules and added enums and one-dimensional arrays to the SMT checker.\n\nImportant Bugfixes:\n\nYul Optimizer: Fix visitation order bug for the structural simplifier.\nOptimizer: Fix overflow in...","url":"/blog/2019/03/13/solidity-0.5.6-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.5 Release Announcement","date":"2019-03-05","author":"Solidity Team","category":"Releases"},"content":"\nThis release focuses on the stabilization of the ABIEncoderV2 and the optimizer. We also prepared for the Petersburg release which is the default EVM now and improved the SMT checker, such that it now reports less false positives when using SafeMath.\nYou can now activate the experimental Yul optimizer using settings: {optimizer: {enabled: true, details: {yul: true}}} or in the commandline via solc optimize-yul.\n\nLanguage Features:\n\nAdd support for getters of mappings with string or bytes key types.\nMeta programming: Provide access to the...","url":"/blog/2019/03/05/solidity-0.5.5-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.4 Release Announcement","date":"2019-02-12","author":"Solidity Team","category":"Releases"},"content":"\nThis release adds support for calldata structs and packed encoding with ABIEncoderV2. We also introduced some changes to the C API and added support for continuous fuzzing via Google oss-fuzz. In addition to that, we added a new commandline option for improved (colorized) diagnostics formatting.\n\nLanguage Features:\n\nAllow calldata structs without dynamically encoded members with ABIEncoderV2.\n\nCompiler Features:\n\nABIEncoderV2: Implement packed encoding.\nC API (libsolc / raw soljson.js): Introduce solidity_free method which releases all internal buffers to save memory.\nCommandline Interface: Adds new option new-reporter for...","url":"/blog/2019/02/12/solidity-0.5.4-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.3 Release Announcement","date":"2019-01-22","author":"Solidity Team","category":"Releases"},"content":"\nThis release adds support for accessing the code of a contract type, which will hopefully make the new CREATE2 opcode easier to use. We also added some static analysis features to the compiler, but most changes were done \"under the hood\" to pave the way for using the new Yul-based optimizer with ABIEncoderV2.\n\nLanguage Features:\n\nProvide access to creation and runtime code of contracts via type(C).creationCode / type(C).runtimeCode.\n\nCompiler Features:\n\nControl Flow Graph: Warn about unreachable code.\nSMTChecker: Support basic typecasts without truncation.\nSMTChecker: Support external...","url":"/blog/2019/01/22/solidity-0.5.3-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.2 Release Announcement","date":"2018-12-19","author":"Solidity Team","category":"Releases"},"content":"\nThis release of the Solidity compiler includes several performance optimizations. These include faster compilation time but also cheaper contracts in some situations. This version also checks for all instances of uninitialized storage references, has some improved error messages and other checks.\n\nYou can now create complete contracts in Yul through the support of the Yul object format and the special functions datasize, dataoffset and datacopy.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of...","url":"/blog/2018/12/19/solidity-0.5.2-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.1 Release Announcement","date":"2018-12-03","author":"Solidity Team","category":"Releases"},"content":"\nThis release improves the usability of interfaces, fixes some bugs, extends the SMT checker and provides an early preview of the Yul optimizer.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2018/12/03/solidity-0.5.1-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.5.0 Release Announcement","date":"2018-11-13","author":"Solidity Team","category":"Releases"},"content":"\nThis is a major breaking release of the Solidity language and compiler that includes many new safety features. In general, programmers have to be more explicit, some weird edge-cases are removed from the language and the low-level compiler interface is much simpler.\n\nThis release was long overdue and as a result has amassed an incredibly long list of changes. Please refer to the \"Solidity v0.5.0 Breaking Changes” section in the documentation about a good description of what has changed and how...","url":"/blog/2018/11/13/solidity-0.5.0-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.25 Release Announcement","date":"2018-09-13","author":"Solidity Team","category":"Releases"},"content":"\nThis release fixed a cleanup error concerning the exponentiation operator. It is a bugfix-only release\nand does not contain any features. A more detailed description of the bugs fixed can be found\non the ethereum blog.\n\nNote that nightly builds of Solidity currently contain changes unrelated to this bugfix release.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2018/09/13/solidity-0.4.25-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.24 Release Announcement","date":"2018-05-16","author":"Solidity Team","category":"Releases"},"content":"\nAll remaining breaking changes planned for version 0.5.0 that can be implemented in a backwards-compatible way made it into this release. Solidity can now detect uninitialized storage pointers using control-flow analysis. It is again possible to assign multiple return values from a function to newly declared variables and the SMT checker is able to work with simple storage variables.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2018/05/16/solidity-0.4.24-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.23 Release Announcement","date":"2018-04-19","author":"Solidity Team","category":"Releases"},"content":"\nBugfix release: In the previous release, it was possible to define two constructors (one using the new constructor-keyword syntax, another one with the old syntax) for a contract, but only one of them got used in the end. We also included other bugfixes.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2018/04/19/solidity-0.4.23-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.22 Release Announcement","date":"2018-04-17","author":"Solidity Team","category":"Releases"},"content":"\nThis release features several major and long-awaited changes:\n\nIt is now possible to access dynamic data (arrays, strings, etc) returned by function calls.\nYou can specify error reason strings for revert and require (support by tooling is still pending).\nWe added the global functions abi.encode(), abi.encodePacked(), abi.encodeWithSelector() and abi.encodeWithSignature() which expose the ABI encoding functions and each return a bytes value.\nConstructors should now be defined using constructor(uint arg1, uint arg2) { ... } to make them stand out and avoid bugs when contracts...","url":"/blog/2018/04/17/solidity-0.4.22-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.21 Release Announcement","date":"2018-03-08","author":"Solidity Team","category":"Releases"},"content":"\nWe again introduced several changes that are scheduled for version 0.5.0 and can be activated using pragma experimental \"v0.5.0\";. In this release, this pragma does not generate a warning anymore, so you can (and should) use it in production code.\n\nIn addition to that, you can now specify which EVM version the contract should be compiled for. Valid values are \"homestead\", \"tangerineWhistle\", \"spuriousDragon\", \"byzantium\" (the default) and \"constantinople\". Depending on this setting, different opcodes will be used in some cases. The...","url":"/blog/2018/03/08/solidity-0.4.21-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.20 Release Announcement","date":"2018-02-14","author":"Solidity Team","category":"Releases"},"content":"\nThis release includes some usability and security improvements and a further evolution of the SMT component. The var keyword has been deprecated for security reasons.\n\nSignificant steps were made in writing optimisation stages for the intermediate language, which will be used by the new ABI encoder to produce highly optimised output. The main goal is to have a resulting bytecode size similar to the old ABI encoder, while having more runtime checks for a stricter decoding process. This is not yet...","url":"/blog/2018/02/14/solidity-0.4.20-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.19 Release Announcement","date":"2017-11-30","author":"Solidity Team","category":"Releases"},"content":"\nIn the last weeks, we have mainly been working on big internal changes. One of them is the new ABI decoder, which is still in experimental mode, but will hopefully be production-usable soon. External contributions like allowing constant variables for array lengths and improved error messages should make your life as a programmer easier. Finally, the standard-json-io-system now allows to select certain artifacts from a contract which should speed up your code-compile-test-cycle even more!\n\nFeatures:\n\nCode Generator: New ABI decoder which supports...","url":"/blog/2017/11/30/solidity-0.4.19-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.18 Release Announcement","date":"2017-10-18","author":"Solidity Team","category":"Releases"},"content":"\nThis release adds further backwards-incompatible security measures enabled via pragma experimental \"v0.5.0\"; and contains another important feature: You can now select to compile only certain contracts using the outputSelection field of the standard-json-io compiler interface, which should speed up tools like truffle tremendously.\n\nThere are also two important bug fixes: One was an oversight in the way bytes variables are allocated in memory and can reduce the memory requirements 32-fold. The second is a security fix: In extremely specific circumstances, it...","url":"/blog/2017/10/18/solidity-0.4.18-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.17 Release Announcement","date":"2017-09-21","author":"Solidity Team","category":"Releases"},"content":"\nAs we are getting closer to the next breaking release, we want to give everyone a heads up by introducing pragma experimental \"v0.5.0\" which already enables some of the new safety features of the 0.5.0 release.\n\nFurthermore, this release finally checks the modifiers view (used to be named constant) and pure on functions. As a rule of thumb, use view if your function does not modify storage and pure if it does not even read any state information - but the...","url":"/blog/2017/09/21/solidity-0.4.17-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.16 Release Announcement","date":"2017-08-24","author":"Solidity Team","category":"Releases"},"content":"\nThis release introduces several new features, some of which have to be\nexplicitly activated using pragma experimental ;.\n\nWe split the constant keyword for functions into pure (neither reads from nor writes to the state)\nand view (does not modify the state). They are not enforced yet, but will most likely make use\nof the the new STATIC_CALL feature after Metropolis.\n\nFurthermore, the ABI encoder was re-implemented in a much cleaner way using our new intermediate language. It can encode arbitrarily nested arrays and will...","url":"/blog/2017/08/24/solidity-0.4.16-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.15 Release Announcement","date":"2017-08-08","author":"Solidity Team","category":"Releases"},"content":"\nThis is mainly a bugfix release that corrects a problem with the return value of the low-level delegatecall function and removes some invalid warning messages.\n\nFeatures:\n\nType Checker: Show unimplemented function if trying to instantiate an abstract class.\n\nBugfixes:\n\nCode Generator: .delegatecall() should always return execution outcome.\nCode Generator: Provide \"new account gas\" for low-level callcode and delegatecall.\nType Checker: Constructors must be implemented if declared.\nType Checker: Disallow the .gas() modifier on ecrecover, sha256 and ripemd160.\nType Checker: Do not mark overloaded functions as shadowing other functions.\nType...","url":"/blog/2017/08/08/solidity-0.4.15-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.14 Release Announcement","date":"2017-07-31","author":"Solidity Team","category":"Releases"},"content":"\nThis release contains several new features and bugfixes and also an important security fix: The ecrecover function can be forced to return invalid data, which can be used to bypass authentication in very special circumstances.\n\nFeatures:\n\nC API (jsonCompiler): Export the license method.\nCode Generator: Optimise the fallback function, by removing a useless jump.\nInline Assembly: Show useful error message if trying to access calldata variables.\nInline Assembly: Support variable declaration without initial value (defaults to 0).\nMetadata: Only include files which were used to compile...","url":"/blog/2017/07/31/solidity-0.4.14-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.13 Release Announcement","date":"2017-07-06","author":"Solidity Team","category":"Releases"},"content":"\nThis is a small bugfix release that fixes several trivial but very annoying bugs that were introduced with 0.4.12. We also deprecate some old features in preparation of the breaking release 0.5.0.\n\nFeatures:\n\nSyntax Checker: Deprecated throw in favour of require(), assert() and revert().\nType Checker: Warn if a local storage reference variable does not explicitly use the keyword storage.\n\nBugfixes:\n\nCode Generator: Correctly unregister modifier variables.\nCompiler Interface: Only output AST if analysis was successful.\nError Output: Do not omit the error type.\n\nA big thank you...","url":"/blog/2017/07/06/solidity-0.4.13-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.12 Release Announcement","date":"2017-07-03","author":"Solidity Team","category":"Releases"},"content":"\nThis release introduces the AST export, solidifies inline assembly, introduces some more warnings and fixes several bugs.\n\nManual jumps in assembly are deprecated in favour of the structured constructs switch, for and function calls also to provide better portability in the future.\n\nFeatures:\n\nAssembly: Add CREATE2 (EIP86), STATICCALL (EIP214), RETURNDATASIZE and RETURNDATACOPY (EIP211) instructions.\nAssembly: Display auxiliary data in the assembly output.\nAssembly: Renamed SHA3 to KECCAK256.\nAST: export all attributes to JSON format.\nC API (jsonCompiler): Use the Standard JSON I/O internally.\nCode Generator: Added the Whiskers...","url":"/blog/2017/07/03/solidity-0.4.12-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.11 Release Announcement","date":"2017-05-03","author":"Solidity Team","category":"Releases"},"content":"\nThis release fixes a bug in the optimizer (more about this on the blog), introduces the standard JSON interface, adds interface contracts and implements some additional safety checks.\n\nThe standard JSON interface provides a unified way to invoke the Solidity compiler in order to ease cross-platform adoption and compilation verification.\n\nFeatures:\n\nImplement the Standard JSON Input / Output API\nSupport interface contracts.\nC API (jsonCompiler): Add the compileStandard() method to process a Standard JSON I/O.\nCommandline interface: Add the standard-json parameter to process a Standard JSON...","url":"/blog/2017/05/03/solidity-0.4.11-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.10 Release Announcement","date":"2017-03-15","author":"Solidity Team","category":"Releases"},"content":"\nThis release is focused on stability and also introduces some new smart contract safety features: require, assert and transfer. Note that the new revert function will only be gas-efficient starting from homestead.\n\nFeatures:\n\nAdd assert(condition), which throws if condition is false (meant for internal errors).\nAdd require(condition), which throws if condition is false (meant for invalid input).\nCommandline interface: Do not overwrite files unless forced.\nIntroduce .transfer(value) for sending Ether.\nCode generator: Support revert() to abort with rolling back, but not consuming all gas.\nInline assembly: Support...","url":"/blog/2017/03/15/solidity-0.4.10-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.9 Release Announcement","date":"2017-01-31","author":"Solidity Team","category":"Releases"},"content":"\nThis release fixes quite some bugs and also adds several new features.\n\nThings to look out for:\n\nTo disambiguate contracts and libraries of the same name in different files, everything is now prefixed by \"filename:\". This applies to the compiler output, the linker input and other things.\nInternal exceptions are now thrown by using an invalid opcode (0xfe), manual exceptions still use an invalid jump.\n\nFeatures:\n\nCompiler interface: Contracts and libraries can be referenced with a file: prefix to make them unique.\nCompiler interface: Report source...","url":"/blog/2017/01/31/solidity-0.4.9-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.8 Release Announcement","date":"2017-01-13","author":"Solidity Team","category":"Releases"},"content":"\nFeatures:\n\nOptimiser: Performance improvements.\nOutput: Print assembly in new standardized Solidity assembly format.\n\nBugfixes:\n\nRemappings: Prefer longer context over longer prefix.\nType checker, code generator: enable access to events of base contracts' names.\nImports: import \".dir/a\" is not a relative path. Relative paths begin with directory . or ...\nType checker: disallow inheritances of different kinds (e.g. a function and a modifier) of members of the same name\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2017/01/13/solidity-0.4.8-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.7 Release Announcement","date":"2016-12-15","author":"Solidity Team","category":"Releases"},"content":"\nFeatures:\n\nBitshift operators.\nType checker: Warn when msg.value is used in non-payable function.\nCode generator: Inject the Swarm hash of a metadata file into the bytecode.\nCode generator: Replace expensive memcpy precompile by simple assembly loop.\nOptimizer: Some dead code elimination.\n\nBugfixes:\n\nCode generator: throw if calling the identity precompile failed during memory (array) copying.\nType checker: string literals that are not valid UTF-8 cannot be converted to string type\nCode generator: any non-zero value given as a boolean argument is now converted into 1.\nAST Json Converter: replace VariableDefinitionStatement...","url":"/blog/2016/12/15/solidity-0.4.7-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.6 Release Announcement","date":"2016-11-22","author":"Solidity Team","category":"Releases"},"content":"\nBugfixes:\n\nOptimizer: Knowledge about state was not correctly cleared for JUMPDESTs\n\nSwarm hash of js compiler: bzzr:/b873fa122233c91b1531527c390f6ca49df4d2a2c5f75706f4b612a0c813cb6a\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2016/11/22/solidity-0.4.6-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.5 Release Announcement","date":"2016-11-21","author":"Solidity Team","category":"Releases"},"content":"\nThis Solidity release adds function types. Use-cases include supplying callbacks for asynchronous or off-chain operations or generic library features (for example map-reduce-style programming). This release also improves the safety of enums and sending Ether to a contract constructor.\n\nFeatures:\n\nFunction types\nDo-while loops: support for a do  while (); control structure\nInline assembly: support invalidJumpLabel as a jump label.\nType checker: now more eagerly searches for a common type of an inline array with mixed types\nCode generator: generates a runtime error when an out-of-range...","url":"/blog/2016/11/21/solidity-0.4.5-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.4 Release Announcement","date":"2016-11-01","author":"Solidity Team","category":"Releases"},"content":"\nThis is a bugfix release that fixes a storage corruption that appears when multiple variables are stored in the same slot (details).\n\nBugfixes:\n\nType checker: forbid signed exponential that led to an incorrect use of EXP opcode.\nCode generator: properly clean higher order bytes before storing in storage.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2016/11/01/solidity-0.4.4-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.3 Release Announcement","date":"2016-10-25","author":"Solidity Team","category":"Releases"},"content":"\nThis is a real bugfix release as you can see from the changelog below. The most important fix concerns the optimizer which generated invalid code connected to the SHA3 opcode in certain situations.\n\nFeatures:\n\nInline assembly: support both suicide and selfdestruct opcodes\n  (note: suicide is deprecated).\nInline assembly: issue warning if stack is not balanced after block.\nInclude keccak256() as an alias to sha3().\nSupport shifting constant numbers.\n\nBugfixes:\n\nCommandline interface: Disallow unknown options in solc.\nName resolver: Allow inheritance of enum definitions.\nType checker: Proper type checking...","url":"/blog/2016/10/25/solidity-0.4.3-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.2 Release Announcement","date":"2016-09-17","author":"Solidity Team","category":"Releases"},"content":"\nBugfixes:\n\nCode Generator: Fix library functions being called from payable functions.\nType Checker: Fixed a crash about invalid array types.\nCode Generator: Fixed a call gas bug that became visible after\n  version 0.4.0 for calls where the output is larger than the input.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2016/09/17/solidity-0.4.2-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.1 Release Announcement","date":"2016-09-09","author":"Solidity Team","category":"Releases"},"content":"\nThis is a bugfix release that fixes an error when compiling libraries with the latest version 0.4.0.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2016/09/09/solidity-0.4.1-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.4.0 Release Announcement","date":"2016-09-08","author":"Solidity Team","category":"Releases"},"content":"\nNote: Version 0.4.0 is unable to compile libraries. Please upgrade to 0.4.1.\n\nThis release deliberately breaks backwards compatibility mostly to enforce some safety features. The most important change is that you have to explicitly specify if functions can receive ether via the payable modifier. Furthermore, more situations cause exceptions to be thrown.\n\nMinimal changes to be made for upgrade:\n\nAdd payable to all functions that want to receive Ether (including the constructor and the fallback function).\nChange ` to ;` in modifiers.\nAdd version pragma...","url":"/blog/2016/09/08/solidity-0.4.0-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.3.6 Release Announcement","date":"2016-08-10","author":"Solidity Team","category":"Releases"},"content":"\nThis is the first release from the new \"solidity-standalone\" repository. It does not have dependencies to cpp-ethereum anymore and can be built just from the solidity github repository.\n\nNote that the optimizer was disabled in some situations which could lead to larger (but correcter) code.\n\nFeatures:\n\nFormal verification: Take external effects on a contract into account.\nType Checker: Warning about unused return value of low-level calls and send.\nOutput: Source location and node id as part of AST output\nOutput: Source location mappings for bytecode\nOutput: Formal...","url":"/blog/2016/08/10/solidity-0.3.6-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.3.5 Release Announcement","date":"2016-06-10","author":"Solidity Team","category":"Releases"},"content":"\nFeatures:\n\nContext-dependent path remappings (different modules can use the same library in different versions)\n\nBugfixes:\n\nType Checking: Dynamic return types were removed when fetching data from external calls, now they are replaced by an \"unusable\" type.\nType Checking: Overrides by constructors were considered making a function non-abstract.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2016/06/10/solidity-0.3.5-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.3.4 Release Announcement","date":"2016-05-31","author":"Solidity Team","category":"Releases"},"content":"\nThis release contains no changes outside of the documentation.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2016/05/31/solidity-0.3.4-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.3.3 Release Announcement","date":"2016-05-27","author":"Solidity Team","category":"Releases"},"content":"\nThis release mainly makes libraries more flexible in that it allows internal functions to be called.\n\nFeatures\n\nAllow internal library functions to be called (by \"inlining\")\nFractional/rational constants (only usable with fixed point types, which are still in progress)\nInline assembly has access to internal functions (as jump labels)\nRunning solc without arguments on a terminal will print help.\n\nFixes\n\nCode Generation: Remove some non-determinism in code generation.\nCode Generation: Corrected usage of not / bnot / iszero in inline assembly\nCode Generation: Correctly clean bytesNN types before comparison\n\nA...","url":"/blog/2016/05/27/solidity-0.3.3-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.3.2 Release Announcement","date":"2016-04-18","author":"Solidity Team","category":"Releases"},"content":"\nThis is mainly a bugfix release. Under the hood, we are in the process of separating the Solidity source code from the rest of the cpp-ethereum source code so that it can soon be built (and released) in isolation.\n\nFixes:\n\nCode generation: Dynamic arrays of structs were not deleted correctly.\nCode generation: Static arrays in constructor parameter list were not decoded correctly.\nParser: Inline assembly parser: byte opcode was unusable\nError reporting: tokens for variably-sized types were not converted to string properly\n\nA big thank you...","url":"/blog/2016/04/18/solidity-0.3.2-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.3.1 Release Announcement","date":"2016-03-31","author":"Solidity Team","category":"Releases"},"content":"\nThis release mainly introduces inline assembly (documentation). Inline assembly provides a way to write low-level but still well readable code. Together with the coming features of inline library functions and templates, it allows to move much of the development that had to be done in the compiler itself into libraries written in Solidity. In the future, it will be possible to introduce new versatile types that still look like builtins.\n\nFeatures:\n\ninline assembly\n\nFixes:\n\nCode generation: array access with narrow types did not clean...","url":"/blog/2016/03/31/solidity-0.3.1-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.3.0 Release Announcement","date":"2016-03-11","author":"Solidity Team","category":"Releases"},"content":"\nThis version is synchronized to the Homestead changes on the main Ethereum network and introduces various breaking changes.\n\nBREAKING CHANGES:\n\nYou should not rely on division for literals resulting in a (truncated) integer. This is still the case but will change once we implement fixed point types, i.e. in the future 1/2 == 0.5 will be true, currently we have 1/2 == 0. Note that this only applies to literals ((2 + 7) / 2) and not variables (x / 2).\nLibrary calls...","url":"/blog/2016/03/11/solidity-0.3.0-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.2.2 Release Announcement","date":"2016-02-17","author":"Solidity Team","category":"Releases"},"content":"\nFeatures:\n\nIndex access for types bytes1, ..., bytes32 (only read access for now).\n\nBugfixes:\n\nType checker crash for wrong number of base constructor parameters.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2016/02/17/solidity-0.2.2-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.2.1 Release Announcement","date":"2016-01-30","author":"Solidity Team","category":"Releases"},"content":"\nThis release includes three major features and one very important bugfix in the optimizer.\n\nIn some situations, the optimizer generated incorrect code. Please always test your code before you use it, unfortunately, we can never guarantee 100% correctness.\n\nWe are especially grateful about the many voluntary community contributions this release received.\nTwo fearless individuals dived deep into the solidity code and delivered two major features: Thanks a lot to @VoR0220 for the inline arrays and to @guanqun for the ternary operator!\nFurthermore, @bobsummerwill spent...","url":"/blog/2016/01/30/solidity-0.2.1-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.2.0 Release Announcement","date":"2015-12-01","author":"Solidity Team","category":"Releases"},"content":"\nFeatures:\n\nAllocation of memory arrays using new.\nBinding library functions to types via using x for y\nBreaking Change**: new ContractName.value(10)() has to be written as (new ContractName).value(10)()\nAdded selfdestruct as an alias for suicide.\n\nBugfixes:\n\nConstructor arguments of fixed array type were not read correctly.\nMemory allocation of structs containing arrays or strings.\nData location for explicit memory parameters in libraries was set to storage.\n\nThe two main features of this release is the ability to create memory arrays (of dynamic length) and to\nattach library functions to types....","url":"/blog/2015/12/01/solidity-0.2.0-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.1.7 Release Announcement","date":"2015-11-17","author":"Solidity Team","category":"Releases"},"content":"\nFeatures:\n\nImproved error messages for unexpected tokens.\nProof-of-concept transcompilation to why3 for formal verification of contracts.\n\nBugfixes:\n\nWriting to elements of bytes or string overwrite others.\nArrays (also strings) as indexed parameters of events.\n\"Successor block not found\" on Windows.\nUsing string literals in tuples.\nCope with invalid commit hash in version for libraries.\nSome test framework fixes on windows.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2015/11/17/solidity-0.1.7-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.1.6 Release Announcement","date":"2015-10-16","author":"Solidity Team","category":"Releases"},"content":"\nFeatures:\n\n.push() for dynamic storage arrays.\nTuple expressions ((1,2,3) or return (1,2,3);)\nDeclaration and assignment of multiple variables (var (x,y,) = (1,2,3,4,5); or var (x,y) = f();)\nDestructuring assignment ((x,y,) = (1,2,3))\nHandling of multiple source files in the json compiler.\n\nBugfixes:\n\nInternal error about usage of library function with invalid types.\nCorrectly parse Library.structType a at statement level.\nCorrectly report source locations of parenthesized expressions (as part of \"tuple\" story).\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2015/10/16/solidity-0.1.6-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.1.5 Release Announcement","date":"2015-10-07","author":"Solidity Team","category":"Releases"},"content":"\nChanges:\n\nBreaking change in storage encoding: Encode short byte arrays and strings together with their length in storage.\nReport warnings.\nAllow storage reference types for public library functions.\nAccess to types declared in other contracts and libraries via ..\nVersion stamp at beginning of runtime bytecode of libraries.\nBugfix: Problem with initialized string state variables and dynamic data in constructor.\nBugfix: Resolve dependencies concerning new automatically.\nBugfix: Allow four indexed arguments for anonymous events.\nBugfix: Detect too large integer constants in functions that accept arbitrary parameters.\n\nA big thank you...","url":"/blog/2015/10/07/solidity-0.1.5-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.1.4 Release Announcement","date":"2015-09-30","author":"Solidity Team","category":"Releases"},"content":"\nChanges:\n\nBugfix: combined-json output of solc incorrectly returned the runtime binary instead of the binary.\nBugfix: Accessing fixed-size array return values.\nBugfix: Disallow assignment from literal strings to storage pointers.\nRefactoring: Move type checking into its own module.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2015/09/30/solidity-0.1.4-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.1.3 Release Announcement","date":"2015-09-22","author":"Solidity Team","category":"Releases"},"content":"\nChanges:\n\nthrow statement.\nLibraries that contain functions which are called via CALLCODE.\nLinker stage for compiler to insert other contract's addresses (used for libraries).\nCompiler option to output runtime part of contracts.\nCompile-time out of bounds check for access to fixed-size arrays by integer constants.\nVersion string includes libevmasm/libethereum's version (contains the optimizer).\nBugfix: Accessors for constant public state variables.\nBugfix: Propagate exceptions in clone contracts.\nBugfix: Empty single-line comments are now treated properly.\nBugfix: Properly check the number of indexed arguments for events.\nBugfix: Strings in struct constructors.\n\nA big thank...","url":"/blog/2015/09/22/solidity-0.1.3-release-announcement"},{"frontmatter":{"layout":"post","published":true,"title":"Solidity 0.1.2 Release Announcement","date":"2015-08-21","author":"Solidity Team","category":"Releases"},"content":"\nChanges:\n\nImproved commandline interface (breaking change).\nExplicit conversion between bytes and string.\nBugfix: Value transfer used in clone contracts.\nBugfix: Problem with strings as mapping keys.\nBugfix: Prevent usage of some operators.\n\nA big thank you to all contributors who helped make this release possible!\n\nDownload the new version of Solidity here.\n","url":"/blog/2015/08/21/solidity-0.1.2-release-announcement"}],"category":"Releases"},"__N_SSG":true}